homework_soap/Public SOAP APIs.postman_collection.json

{
  "info": {
    "_postman_id": "c0a8e6f2-e9ab-4fa5-966f-0ff1bc2708de",
    "name": "Public SOAP APIs",
    "description": "This is a collection of different SOAP APIs that are completley public and do not require any authentication, making it easier for consumers to play with and understand what APIs are all about by seeing the many different ways in which APIs can be used.",
    "schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
    "_exporter_id": "51453377",
    "_collection_link": "https://go.postman.co/collection/51453377-c0a8e6f2-e9ab-4fa5-966f-0ff1bc2708de?source=collection_link"
  },
  "item": [
    {
      "name": "Book ISBN Numbers",
      "item": [
        {
          "name": "Is Valid ISBN13 Number",
          "event": [
            {
              "listen": "test",
              "script": {
                "exec": [
                  "let response = pm.response.text();",
                  "let json = xml2Json(response);",
                  "",
                  "let result = json[\"soap:Envelope\"][\"soap:Body\"]",
                  "[\"m:IsValidISBN13Response\"][\"m:IsValidISBN13Result\"];",
                  "",
                  "",
                  "pm.test(\"Status code is 200\", () => {",
                  "    pm.response.to.have.status(200);",
                  "});",
                  "",
                  "pm.test(\"Response is not empty\", () => {",
                  "    pm.expect(response).to.not.be.empty;",
                  "});",
                  "",
                  "pm.test(\"Contains SOAP Envelope\", () => {",
                  "    pm.expect(response).to.include(\"<soap:Envelope\");",
                  "});",
                  "",
                  "pm.test(\"Contains SOAP Body\", () => {",
                  "    pm.expect(response).to.include(\"<soap:Body>\");",
                  "});",
                  "",
                  "pm.test(\"Contains ISBN13 response node\", () => {",
                  "    pm.expect(response).to.include(\"IsValidISBN13Response\");",
                  "});",
                  "",
                  "pm.test(\"Result exists\", () => {",
                  "    pm.expect(result).to.exist;",
                  "});",
                  "",
                  "pm.test(\"Result is true or false\", () => {",
                  "    pm.expect([\"true\", \"false\"]).to.include(result);",
                  "});",
                  "",
                  "pm.test(\"ISBN13 is valid\", () => {",
                  "    pm.expect(result).to.eql(\"true\");",
                  "});",
                  "",
                  "pm.test(\"Content-Type is XML\", () => {",
                  "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"xml\");",
                  "});",
                  "",
                  "pm.test(\"Response time < 2000ms\", () => {",
                  "    pm.expect(pm.response.responseTime).to.be.below(2000);",
                  "});",
                  "",
                  "pm.test(\"Envelope namespace is correct\", () => {",
                  "    pm.expect(response).to.include('xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"');",
                  "});",
                  "",
                  "pm.test(\"ISBN namespace is correct\", () => {",
                  "    pm.expect(response).to.include('xmlns:m=\"http://webservices.daehosting.com/ISBN\"');",
                  "});"
                ],
                "type": "text/javascript",
                "packages": {},
                "requests": {}
              }
            }
          ],
          "request": {
            "method": "POST",
            "header": [
              {
                "key": "Content-Type",
                "value": "text/xml; charset=utf-8",
                "type": "text"
              }
            ],
            "body": {
              "mode": "raw",
              "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\n      <sISBN>978-1-4612-9090-2</sISBN>\n    </IsValidISBN13>\n  </soap:Body>\n</soap:Envelope>"
            },
            "url": {
              "raw": "http://webservices.daehosting.com/services/isbnservice.wso",
              "protocol": "http",
              "host": [
                "webservices",
                "daehosting",
                "com"
              ],
              "path": [
                "services",
                "isbnservice.wso"
              ]
            },
            "description": "The test is done by calculation on the first 12 digits and compare the result with the checksum number at the end. You have to pass a 13 digits number."
          },
          "response": []
        },
        {
          "name": "Is Valid ISBN10 Number",
          "event": [
            {
              "listen": "test",
              "script": {
                "exec": [
                  "let response = pm.response.text();",
                  "let json = xml2Json(response);",
                  "",
                  "let result = json[\"soap:Envelope\"][\"soap:Body\"]",
                  "[\"m:IsValidISBN10Response\"][\"m:IsValidISBN10Result\"];",
                  "",
                  "console.log(result);",
                  "",
                  "",
                  "pm.test(\"Status code is 200\", () => {",
                  "    pm.response.to.have.status(200);",
                  "});",
                  "",
                  "pm.test(\"Response is not empty\", () => {",
                  "    pm.expect(response).to.not.be.empty;",
                  "});",
                  "",
                  "// 3",
                  "pm.test(\"Contains SOAP Envelope\", () => {",
                  "    pm.expect(response).to.include(\"<soap:Envelope\");",
                  "});",
                  "",
                  "pm.test(\"Contains SOAP Body\", () => {",
                  "    pm.expect(response).to.include(\"<soap:Body>\");",
                  "});",
                  "",
                  "pm.test(\"Contains ISBN10 response node\", () => {",
                  "    pm.expect(response).to.include(\"IsValidISBN10Response\");",
                  "});",
                  "",
                  "pm.test(\"Result exists\", () => {",
                  "    pm.expect(result).to.exist;",
                  "});",
                  "",
                  "pm.test(\"Result is true or false\", () => {",
                  "    pm.expect([\"true\", \"false\"]).to.include(result);",
                  "});",
                  "",
                  "pm.test(\"ISBN10 is valid\", () => {",
                  "    pm.expect(result).to.eql(\"true\");",
                  "});",
                  "",
                  "pm.test(\"Content-Type is XML\", () => {",
                  "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"xml\");",
                  "});",
                  "",
                  "pm.test(\"No SOAP Fault\", () => {",
                  "    pm.expect(response).to.not.include(\"Fault\");",
                  "});",
                  "",
                  "pm.test(\"Envelope namespace is correct\", () => {",
                  "    pm.expect(response).to.include('xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"');",
                  "});",
                  "",
                  "pm.test(\"ISBN namespace is correct\", () => {",
                  "    pm.expect(response).to.include('xmlns:m=\"http://webservices.daehosting.com/ISBN\"');",
                  "});"
                ],
                "type": "text/javascript",
                "packages": {},
                "requests": {}
              }
            }
          ],
          "protocolProfileBehavior": {
            "disabledSystemHeaders": {
              "content-type": true,
              "user-agent": true,
              "accept": true,
              "accept-encoding": true,
              "connection": true
            }
          },
          "request": {
            "method": "POST",
            "header": [
              {
                "key": "Content-Type",
                "value": "text/xml; charset=utf-8",
                "type": "text"
              }
            ],
            "body": {
              "mode": "raw",
              "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <IsValidISBN10 xmlns=\"http://webservices.daehosting.com/ISBN\">\n      <sISBN>0-19-852663-6</sISBN>\n    </IsValidISBN10>\n  </soap:Body>\n</soap:Envelope>"
            },
            "url": {
              "raw": "http://webservices.daehosting.com/services/isbnservice.wso",
              "protocol": "http",
              "host": [
                "webservices",
                "daehosting",
                "com"
              ],
              "path": [
                "services",
                "isbnservice.wso"
              ]
            },
            "description": "The test is done by calculation on the first 9 digits and compare the result with the checksum number at the end. You have to pass a 10 digits number or 8 digits and an X."
          },
          "response": []
        }
      ],
      "description": "SOAP APIs for book ISBN numbers.",
      "event": [
        {
          "listen": "prerequest",
          "script": {
            "type": "text/javascript",
            "exec": [
              ""
            ]
          }
        },
        {
          "listen": "test",
          "script": {
            "type": "text/javascript",
            "exec": [
              ""
            ]
          }
        }
      ]
    }
  ],
  "event": [
    {
      "listen": "prerequest",
      "script": {
        "type": "text/javascript",
        "exec": [
          ""
        ]
      }
    },
    {
      "listen": "test",
      "script": {
        "type": "text/javascript",
        "exec": [
          ""
        ]
      }
    }
  ]
}